app/controllers/backoffice/admins_controller.rb

  def create
    @admin = Admin.new(params_admin)
    if @admin.save
---
INSERT INTO `admins` (`name`, `email`, `role`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('Henrique Shiraishi', 'henrique@henrique.com', 0, '$2a$11$7irg77uXnwfPpuSRbeDjoOvqcYXPl4u6JXgWswNDzemf/od0o//Km', '2017-01-19 02:26:30', '2017-01-19 02:26:30')

  def update
    if @admin.update(params_admin)
---
UPDATE `admins` SET `role` = 0, `encrypted_password` = '$2a$11$PQOP4UaZzsbHLDaboQeg6OP0M2bU4wCzyj14njNINs4ht7lOWjJYa', `updated_at` = '2017-01-19 02:24:43' WHERE `admins`.`id` = 2

  def destroy
    authorize @admin
    admin_email = @admin.email
    if @admin.destroy
---
DELETE FROM `admins` WHERE `admins`.`id` = 2

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 2  ORDER BY `admins`.`id` ASC LIMIT 1