app/controllers/backoffice/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
  def index
    @categories = Category.all

INSERT INTO `categories` (`description`, `created_at`, `updated_at`) VALUES ('Animais/Pets', '2017-01-06 01:19:26', '2017-01-06 01:19:26')
---
  def create
    @category = CategoryService.create(params_category)

UPDATE `categories` SET `description` = 'Outros', `updated_at` = '2017-01-06 23:12:46' WHERE `categories`.`id` = 12
---
  def update
    if @category.update(params_category)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 12 LIMIT 1
---
def set_category
  @category = Category.friendly.find(params[:id])