app/controllers/site/home_controller.rb

SELECT `categories`.* FROM `categories`
---
  def index
    @categories = Category.order_by_description